In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
sns.set()

In [5]:
df = pd.read_csv("../DATA/airport_boardings.csv", index_col=1)
df.head()

,Airport,2001 Rank,2001 Total,2010 Rank,2010 Total,2011 Rank,Total,Percent change 2001-2011,Percent change 2010-2011
Code,,,,,,,,,
ATL,"Atlanta, GA (Hartsfield-Jackson Atlanta Intern...",1,"36,384,264",1,"42,655,392",1,"33,034,788",-9.2,-22.6
ORD,"Chicago, IL (Chicago O'Hare International)",2,"28,626,694",2,"30,033,313",2,"22,367,052",-21.9,-25.5
DFW,"Dallas, TX (Dallas/Fort Worth International)",3,"25,198,256",3,"26,785,739",3,"20,430,281",-18.9,-23.7
DEN,"Denver, CO (Denver International)",6,"16,397,390",4,"24,965,553",4,"19,190,341",17.0,-23.1
LAX,"Los Angeles, CA (Los Angeles International)",4,"22,873,307",5,"22,860,849",5,"18,379,418",-19.6,-19.6

## Get data for Atlanta

In [9]:
df.loc['ATL']

Airport                     Atlanta, GA (Hartsfield-Jackson Atlanta Intern...
2001 Rank                                                                   1
2001 Total                                                         36,384,264
2010 Rank                                                                   1
2010 Total                                                         42,655,392
2011 Rank                                                                   1
 Total                                                             33,034,788
Percent change 2001-2011                                                 -9.2
Percent change 2010-2011                                                -22.6
Name: ATL, dtype: object